Repository: ThePi2K/BarbellCalc
Catalog: barbell_calc/lib/l10n/app_*.arb
Languages: de

source: Home
de: Start

source: Inventory
de: Inventar

source: Settings
de: Einstellungen

source: Weight on Barbell
de: Gewicht auf Hantel

source: Training Weight
de: Trainingsgewicht

source: Choose Barbell
de: Wähle Hantel

source: Weight cannot be empty!
de: Du musst ein Gewicht angeben!

source: Weight is invalid!
de: Das Gewicht ist ungültig!

# new_world_record
source: That breaks the world record! Congratulations!
de: Damit brichst du den Weltrekord! Herzlichen Glückwunsch!

source: CHECK DETAILS
de: MEHR DAZU

# you_need_a_barbell
source: You need to choose a Barbell!
de: Du musst eine Hantel auswählen!

# you_need_more_weight
source: You need to choose more weight!
de: Du musst mehr Gewicht wählen!

# different_training_weight
source: The entered weight ({trainingWeight}) differs from the possible training weight ({possibleTrainingWeight})!
de: Das eingegebene Gewicht ({trainingWeight}) weicht vom möglichen Trainingsgewicht ({possibleTrainingWeight}) ab!

source: Add Barbell
de: Neue Langhantel

source: Add Plate
de: Neue Scheibe

source: Plate Weight
de: Gewicht Scheibe

source: Select Width
de: Durchmesser auswählen

# plate_exists
source: Plate is already existing!
de: Die Scheibe wurde bereits gespeichert!

# plate_has_to_weight_more_than_0
source: The Plate has to weight more than 0 {metricUnit}!
de: Die Scheibe muss mehr als 0 {metricUnit} wiegen!

source: Barbell Name
de: Name der Hantel

source: Barbell Weight
de: Hantelgewicht

source: Name cannot be empty!
de: Du musst einen Namen angeben!

# barbell_exists
source: Barbell is already existing!
de: Die Hantel wurde bereits gespeichert!

# barbell_has_to_weight_more_than_0
source: The Barbell has to weight more than 0 {metricUnit}!
de: Die Hantel muss mehr als 0 {metricUnit} wiegen!

# at_least_one_barbell
source: You need at least one {barbellWidth} Barbell!
de: Du brauchst mindestens eine {barbellWidth} Hantel!

# at_least_one_plate
source: You need at least one {barbellWidth} Plate!
de: Du brauchst mindestens eine {barbellWidth} Scheibe!

source: Editing Barbell
de: Langhantel bearbeiten

source: Barbells
de: Langhanteln

source: Plates
de: Scheiben

# really_want_to_delete_barbell
source: Do really want to remove this Barbell?
de: Willst du diese Hantel wirklich löschen?

# really_want_to_delete_plate
source: Do really want to remove this Plate?
de: Willst du diese Scheibe wirklich löschen?

source: Error
de: Fehler

source: Attention!
de: Achtung!

source: SAVE
de: SPEICHERN

source: CANCEL
de: ABBRECHEN

source: YES
de: JA

source: NO
de: NEIN
